{
  "getStarted": "Bearbeite <0>src/app/page.tsx</0>, um loszulegen.",
  "saveChanges": "Speichere und sieh dir deine Änderungen sofort an.",
  "deployNow": "Jetzt deployen",
  "readDocs": "Unsere Doks lesen",
  "learn": "Lernen",
  "examples": "Beispiele",
  "goToNextJSA": "Zu nextjs.org gehen →",
  "domainForSale": "Diese Domain ist zu erwerben – einfach <0>kontaktieren</0>!",
  "contactMe": "kontaktiere mich",
  "impressumTitle": "Impressum",
  "impressumAddressLine1": "Angaben gemäß § 5 TMG",
  "impressumAddressLine2": "Bjarne Niklas Luttermann",
  "impressumAddressLine3": "Musterstraße 1",
  "impressumAddressLine4": "70173 Stuttgart",
  "impressumAddressLine5": "Deutschland",
  "impressumEmail": "aurav.tech@gmail.com",
  "impressumResponsible": "Verantwortlich für den Inhalt nach § 55 Abs. 2 RStV: Bjarne Niklas Luttermann, Adresse wie oben",
  "impressumDisclaimerTitle": "Haftungsausschluss",
  "impressumDisclaimer": "Trotz sorgfältiger inhaltlicher Kontrolle übernehme ich keine Haftung für die Inhalte externer Links. Für den Inhalt der verlinkten Seiten sind ausschließlich deren Betreiber verantwortlich.",
  "impressumCopyrightTitle": "Urheberrecht",
  "impressumCopyright": "Die durch den Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Beiträge Dritter sind als solche gekennzeichnet.",
  "impressumNote": "Dieses Impressum gilt auch für die Social-Media-Profile, sofern vorhanden.",
  "datenschutzTitle": "Datenschutzerklärung",
  "datenschutzIntro": "Diese Website erhebt und speichert keine personenbezogenen Daten. Es werden keine Cookies gesetzt und kein Tracking eingesetzt.",
  "datenschutzContactTitle": "Kontaktaufnahme",
  "datenschutzContact": "Wenn Sie mir per E-Mail Anfragen zukommen lassen, werden Ihre Angaben aus der E-Mail inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen gespeichert. Diese Daten gebe ich nicht ohne Ihre Einwilligung weiter.",
  "datenschutzLogTitle": "Server-Log-Files",
  "datenschutzLog": "Der Provider der Seiten erhebt und speichert automatisch Informationen in so genannten Server-Log Files, die Ihr Browser automatisch übermittelt. Diese Daten sind nicht bestimmten Personen zuordenbar. Eine Zusammenführung dieser Daten mit anderen Datenquellen wird nicht vorgenommen.",
  "datenschutzRightsTitle": "Rechte",
  "datenschutzRights": "Sie haben jederzeit das Recht auf unentgeltliche Auskunft über Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empfänger und den Zweck der Datenverarbeitung sowie ein Recht auf Berichtigung, Sperrung oder Löschung dieser Daten.",
  "datenschutzNote": "Für Fragen zum Datenschutz wenden Sie sich bitte an: ",
  "datenschutzEmail": "aurav.tech@gmail.com"
}
