{
  "getStarted": "Get started by editing <0>src/app/page.tsx</0>.",
  "saveChanges": "Save and see your changes instantly.",
  "deployNow": "Deploy now",
  "readDocs": "Read our docs",
  "learn": "Learn",
  "examples": "Examples",
  "goToNextJSA": "Go to nextjs.org →",
  "domainForSale": "This domain is for sale – simply <0>contact me</0>!",
  "contactMe": "contact me",
  "impressumTitle": "Legal Notice",
  "impressumAddressLine1": "Information according to § 5 TMG (German law)",
  "impressumAddressLine2": "Bjarne Niklas Luttermann",
  "impressumAddressLine3": "Musterstraße 1",
  "impressumAddressLine4": "70173 Stuttgart",
  "impressumAddressLine5": "Germany",
  "impressumEmail": "aurav.tech@gmail.com",
  "impressumResponsible": "Responsible for content according to § 55 Abs. 2 RStV: Bjarne Niklas Luttermann, address as above",
  "impressumDisclaimerTitle": "Disclaimer",
  "impressumDisclaimer": "Despite careful content control, I assume no liability for the content of external links. The operators of the linked pages are solely responsible for their content.",
  "impressumCopyrightTitle": "Copyright",
  "impressumCopyright": "The content and works created by the site operator on these pages are subject to German copyright law. Contributions by third parties are marked as such.",
  "impressumNote": "This legal notice also applies to social media profiles, if available.",
  "datenschutzTitle": "Privacy Policy",
  "datenschutzIntro": "This website does not collect or store any personal data. No cookies are set and no tracking is used.",
  "datenschutzContactTitle": "Contact",
  "datenschutzContact": "If you send me inquiries by e-mail, your details from the e-mail, including the contact details you provide there, will be stored for the purpose of processing the inquiry and in case of follow-up questions. I will not pass on this data without your consent.",
  "datenschutzLogTitle": "Server Log Files",
  "datenschutzLog": "The provider of these pages automatically collects and stores information in so-called server log files, which your browser automatically transmits. This data cannot be assigned to specific persons. This data is not merged with other data sources.",
  "datenschutzRightsTitle": "Your Rights",
  "datenschutzRights": "You have the right at any time to free information about your stored personal data, its origin and recipient and the purpose of data processing as well as a right to correction, blocking or deletion of this data.",
  "datenschutzNote": "For questions about data protection, please contact: ",
  "datenschutzEmail": "aurav.tech@gmail.com"
}
